Ran Plan for dir: `Terraform/Project/infrastructure` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/var/lib/atlantis/repos/IvanChet-4/DevOps_D/34/default/Terraform/Project/infrastructure/default.tfplan"' in '/var/lib/atlantis/repos/IvanChet-4/DevOps_D/34/default/Terraform/Project/infrastructure': exit status 1

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # yandex_vpc_network.default will be created
  + resource "yandex_vpc_network" "default" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "my-vpc"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.subnet1 will be created
  + resource "yandex_vpc_subnet" "subnet1" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-1"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.10.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.subnet2 will be created
  + resource "yandex_vpc_subnet" "subnet2" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-2"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.20.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.subnet3 will be created
  + resource "yandex_vpc_subnet" "subnet3" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet-3"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.30.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Error: Invalid function argument
│ 
│   on main.tf line 57, in resource "yandex_compute_instance" "public_instance":
│   57:   ssh-keys = "${var.ssh_user}:${file(var.ssh_public_key)}"
│     ├────────────────
│     │ while calling file(path)
│     │ var.ssh_public_key is "~/.ssh/id_ed25519.pub"
│ 
│ Invalid value for "path" parameter: no file exists at
│ "~/.ssh/id_ed25519.pub"; this function works only with files that are
│ distributed as part of the configuration source code, so if this file will
│ be created by a resource in this configuration you must instead obtain this
│ result from an attribute of that resource.
╵
╷
│ Error: Invalid function argument
│ 
│   on main.tf line 57, in resource "yandex_compute_instance" "public_instance":
│   57:   ssh-keys = "${var.ssh_user}:${file(var.ssh_public_key)}"
│     ├────────────────
│     │ while calling file(path)
│     │ var.ssh_public_key is "~/.ssh/id_ed25519.pub"
│ 
│ Invalid value for "path" parameter: no file exists at
│ "~/.ssh/id_ed25519.pub"; this function works only with files that are
│ distributed as part of the configuration source code, so if this file will
│ be created by a resource in this configuration you must instead obtain this
│ result from an attribute of that resource.
╵
╷
│ Error: Invalid function argument
│ 
│   on main.tf line 57, in resource "yandex_compute_instance" "public_instance":
│   57:   ssh-keys = "${var.ssh_user}:${file(var.ssh_public_key)}"
│     ├────────────────
│     │ while calling file(path)
│     │ var.ssh_public_key is "~/.ssh/id_ed25519.pub"
│ 
│ Invalid value for "path" parameter: no file exists at
│ "~/.ssh/id_ed25519.pub"; this function works only with files that are
│ distributed as part of the configuration source code, so if this file will
│ be created by a resource in this configuration you must instead obtain this
│ result from an attribute of that resource.
╵


```
</details>